In [3]:
# where is the youngest male in the group from?

#a. Find the answer using sort_values()

#b. Do some research and find the answer using where() and min()

#c. Do some research and find the answer using query() and min()

In [80]:
import pandas as pd
names=["Tomás", "Pauline", "Pablo", "Bjork","Alan","Juana"]
woman=[False,True,False,False,False,True]
ages=[32,33,28,30,32,27]
country=["Chile", "Senegal", "Spain", "Norway","Peru","Peru"]
education=["Bach", "Bach", "Master", "PhD","Bach","Master"]

In [81]:
data={'names':names,'woman':woman,'ages':ages,'country':country,'education':education}
data

{'names': ['Tomás', 'Pauline', 'Pablo', 'Bjork', 'Alan', 'Juana'],
 'woman': [False, True, False, False, False, True],
 'ages': [32, 33, 28, 30, 32, 27],
 'country': ['Chile', 'Senegal', 'Spain', 'Norway', 'Peru', 'Peru'],
 'education': ['Bach', 'Bach', 'Master', 'PhD', 'Bach', 'Master']}

In [82]:
friends=pd.DataFrame.from_dict(data)
friends

     names  woman  ages  country education
0    Tomás  False    32    Chile      Bach
1  Pauline   True    33  Senegal      Bach
2    Pablo  False    28    Spain    Master
3    Bjork  False    30   Norway       PhD
4     Alan  False    32     Peru      Bach
5    Juana   True    27     Peru    Master

In [83]:
toSort=["ages"]
Order=[True]
friendscopy1=friends.sort_values(by=toSort,ascending=Order).reset_index()
friendscopy

   index    names  woman  ages  country education
0      5    Juana   True    27     Peru    Master
1      2    Pablo  False    28    Spain    Master
2      3    Bjork  False    30   Norway       PhD
3      0    Tomás  False    32    Chile      Bach
4      4     Alan  False    32     Peru      Bach
5      1  Pauline   True    33  Senegal      Bach

In [84]:
friendscopy1.head(1).country
#this isn't correct because it isn't a male. I have NO IDEA how to additionally qualify by Woman==False
#I've iterated other options here to return results conditionally but have failed miserably to avoid errors.

0    Peru
Name: country, dtype: object

In [85]:
#I also figured out how to maintain the structure after doing something with inplace=true This is still incorrect because I need to only return the value for woman==False
friends.sort_values('ages',ascending=True,inplace=True)
friends.head(1).country

5    Peru
Name: country, dtype: object